package com.example.catsanddogstelegram.constants;

public enum PreparingInfoCat {
    CAT_RULES_OF_DATING("Если вы увидели кошку в каталоге, напишите в наш телеграм-бот и договоритесь о встерче." +
            "Если вы выбрали кошку, не забирайте её в первый же день. " +
            "Сначала спросите у сотрудников о привычках и предпочтениях животного." +
            "Запаситесь тем же кормом, которым кормят в приюте. Пусть он не того качества, который бы хотелось, " +
            "но если перевести кота сразу на другой корм по приезду в ваш дом, то это спровоцирует у него стресс.\n" +
            "\n" +
            "В первый день вы можете угостить кота лакомством и поговорить с ним." +
            "Понаблюдайте, как животное ведет себя в более-менее привычной для него среде обитания: " +
            "общается ли с другими кошками, не слишком ли агрессивно или чрезмерно пассивно." +
            "Во второй день, когда дома будет готово кошачье приданое, нужно снова подойти к клетке с кошкой." +
            " Понаблюдайте для интереса, приблизится ли кошка к вам."),

    TRANSPORTATION_ADVICE("Для перевозки кота понадобится переноска. " +
            "Это не прихоть, а необходимость: в переноске кошка будет чувствовать себя спокойнее." +
            "В будущем она пригодится для посещения ветеринара." +
            "По проходу домой поставьте переноску в комнату и откройте её. " +
            "Там заранее должны стоять лоток, миски с едой и водой, игрушки."),

    PREPARING_HOUSE_FOR_A_PUPPY_CAT("Во-первых, пройдите по всем комнатам и выявите потенциально опасные места для кошек." +
            " Это могут быть окна без москитных сеток, разбросанные на полу провода, в которых кошка может просто запутаться и т.д.\n" +
            "Не оставляйте на полу в ванной стиральные порошки и химикаты .\n" +
            "Установите на окна гребенки-ограничители, если не любите сетки. \n" +
            "В таком случае, оставляйте небольшой пространство для проветривания, чтобы кот в окно не пролез.\n" +
            "Уберите хрупкие декоративные предметы из поля досягаемости кошки.\n" +
            "Установите на окнах сетки антикошки, если любите проветривать помещение, открывая окна широко.\n" +
            "Тоже самое с комнатными растениями, некоторые из них представляют серьезную опасность для кошек \n" +
            " Во-вторых, приобретите в зоомагазине: две миски (для корма и для воды);\n" +
            "корм (при выборе готовых кормов остерегайтесь подделок, а если вы решили кормить питомца «натуралкой», " +
            "заранее составьте меню, приобретите крупы, субпродукты, овощи);\n" +
            "лоток и наполнитель (при их выборе лотка учитывайте размер и возраст животного);\n" +
            "когтеточку.\n" +
            "Не спешите покупать игровые комплексы, домики и прочие дорогостоящие атрибуты." +
            " Они нужны и полезны, ваш питомец за них только спасибо скажет, но это, возможно, будет нескоро."),

    PREPARING_HOUSE_FOR_AN_ADULT_CAT("Для взрослой кошки правила аналогичные." +
            "Во-первых, пройдите по всем комнатам и выявите потенциально опасные места для кошек." +
            " Это могут быть окна без москитных сеток, разбросанные на полу провода, в которых кошка может просто запутаться и т.д.\n" +
            "Не оставляйте на полу в ванной стиральные порошки и химикаты .\n" +
            "Установите на окна гребенки-ограничители, если не любите сетки. \n" +
            "В таком случае, оставляйте небольшой пространство для проветривания, чтобы кот в окно не пролез.\n" +
            "Уберите хрупкие декоративные предметы из поля досягаемости кошки.\n" +
            "Установите на окнах сетки антикошки, если любите проветривать помещение, открывая окна широко.\n" +
            "Тоже самое с комнатными растениями, некоторые из них представляют серьезную опасность для кошек \n" +
            " Во-вторых, приобретите в зоомагазине: две миски (для корма и для воды);\n" +
            "корм (при выборе готовых кормов остерегайтесь подделок, а если вы решили кормить питомца «натуралкой», " +
            "заранее составьте меню, приобретите крупы, субпродукты, овощи);\n" +
            "лоток и наполнитель (при их выборе лотка учитывайте размер и возраст животного);\n" +
            "когтеточку.\n" +
            "Не спешите покупать игровые комплексы, домики и прочие дорогостоящие атрибуты." +
            " Они нужны и полезны, ваш питомец за них только спасибо скажет, но это, возможно, будет нескоро."),
    PREPARING_HOUSE_FOR_A_DISABLED_CAT("Для кошки с особенностями правила аналогичные," +
            " но также необходима консультация c ветеринаром в зависимости от особенностей животного.\n" +
            "Во-первых, пройдите по всем комнатам и выявите потенциально опасные места для кошек." +
            " Это могут быть окна без москитных сеток, разбросанные на полу провода, в которых кошка может просто запутаться и т.д.\n" +
            "Не оставляйте на полу в ванной стиральные порошки и химикаты .\n" +
            "Установите на окна гребенки-ограничители, если не любите сетки. \n" +
            "В таком случае, оставляйте небольшой пространство для проветривания, чтобы кот в окно не пролез.\n" +
            "Уберите хрупкие декоративные предметы из поля досягаемости кошки.\n" +
            "Установите на окнах сетки антикошки, если любите проветривать помещение, открывая окна широко.\n" +
            "Тоже самое с комнатными растениями, некоторые из них представляют серьезную опасность для кошек \n" +
            " Во-вторых, приобретите в зоомагазине: две миски (для корма и для воды);\n" +
            "корм (при выборе готовых кормов остерегайтесь подделок, а если вы решили кормить питомца «натуралкой», " +
            "заранее составьте меню, приобретите крупы, субпродукты, овощи);\n" +
            "лоток и наполнитель (при их выборе лотка учитывайте размер и возраст животного);\n" +
            "когтеточку.\n" +
            "Не спешите покупать игровые комплексы, домики и прочие дорогостоящие атрибуты." +
            " Они нужны и полезны, ваш питомец за них только спасибо скажет, но это, возможно, будет нескоро."),

    REASONS_FOR_REFUSAL("Существует пять причин, по которым чаще всего отказывают желающим «усыновить» домашнего любимца :\n" +
            "1. Большое количество животных дома; \n" +
            "2. Нестабильные отношения в семье; \n" +
            "3. Наличие маленьких детей; \n" +
            "4. Съемное жилье;\n" +
            "5. Животное в подарок или для работы.\n");


    private final String typeOfInfo;

    private PreparingInfoCat(String typeOfInfo) {
        this.typeOfInfo = typeOfInfo;
    }

    public String getTypeOfInfo() {
        return this.getTypeOfInfo();
    }
}
