package com.example.catsanddogstelegram.constants;

public enum PreparingInfoDog {
    DOG_RULES_OF_DATING("Если вы увидели собаку в каталоге, напишите в наш телеграм-бот и договоритесь о встерче." +
            " Ключ к дружбе с собакой — с момента знакомства наладить контакт." +
            " При встрече в приюте постарайтесь провести с питомцем как можно больше времени: " +
            "будьте спокойны и аккуратны при общении, не ждите любви с первого взгляда - вы пока еще чужой человек. " +
            "При знакомстве с собакой, попросите куратора дать вам поводок и пройдитесь с ней, но только под присмотром." +
            " Ваши жесты, слова, действия не должны пугать собаку. Не позволяйте ей усомниться в том, что вам можно доверять." +
            " Собаку нужно хорошо выгуливать, поощрять ее хорошее поведение лакомством. " +
            "Ей важны и физическая нагрузка, и эмоциональный отклик от новых хозяев."),
    LIST_OF_DOCUMENTS_TO_ADOPT("1. Паспорт\n" +
            "2. Фотографии места будущего обитания животного\n" +
            "3. Согласие всех членов семьи, проживающих совместно\n"),

    TRANSPORTATION_ADVICE("Забирать собаку лучше всего на машине." +
            " Нужно будет застелить какой-нибудь ненужной тканью сиденье, так как собака вряд ли будет чистой." +
            " Перевозить собаку из приюта домой лучше в специальном контейнере-переноске." +
            " Некоторые собаки испытывают стресс в автомобиле, особенно если раньше они на автомобиле не катались. " +
            "Наличие специальной перевозки сделает поездку легче и для Вас, и для собаки."),

    PREPARING_HOUSE_FOR_A_PUPPY_DOG("Ваша задача сделать так, чтобы первые дни щенка в новом доме стали максимально комфортными.\n" +
            "Поэтому нужно приобрести следующие вещи:\n" +
            "1. Две миски. Одна предназначена для еды, вторая — для воды.\n" +
            "2. Поводок и мягкий намордник. Если ошейник не был куплен заранее, то его обязательно нужно приобрести.\n" +
            "3. Принадлежности для ухода за шерстью.\n" +
            "4. Игрушки.\n" +
            "5. Лежанку, которая будет подходить по размеру.\n" +
            "6. Домашний вольер.В нем будет уютная лежанка и игрушки. Да, вольер оборудован дверцей, чтобы можно было изолировать питомца, " +
            " Но помните, что первые дни щенка в новом доме — неподходящее время для того, чтобы оставлять его одного.\n " +
            "Дайте питомцу время привыкнуть.\n" +
            "7. Корм. Вам потребуется запас примерно на неделю. Выбирайте тот корм, к которому приучил щенков заводчик.\n" +
            "\n"),

    PREPARING_HOUSE_FOR_AN_ADULT_DOG("Уберите все, что представляет опасность - провода, бытовую химию и т.д. " +
            "Закройте мусорные корзины, проверьте, чтобы входная дверь плотно закрывалась. " +
            "Не забывайте: опасны для питомцев даже некоторые комнатные растения. " +
            "Взгляните на свою квартиру глазами собаки: что можно достать, что отодрать, что порвать, где стащить, " +
            "куда достать, почему торчит. Если у вас стоят на полу цветы, закройте почву специальной сеткой, книги," +
            " журналы убирайте в шкаф, если вдруг у вас где-то есть кусок обоев, что вот-вот отвалится, " +
            "советуем приклеить покрепче.\n" +
            "\n" +
            "Взрослая собака может ходить первое время в туалет дома." +
            " Убираем ковры, что нам дороги, размещаем огромное количество пелёнок, перестаём раскидывать толстовки. " +
            "Во время вашего отсутствия или даже при вас, но в момент жуткой скуки щенок может найти себе веселое развлечение." +
            " Вещи, которые вам очень дороги уберите подальше. " +
            "Собаку нельзя ругать, так что сберегите сами«порядок в доме» – ваш главный лозунг. \n +" +
            "\n" +
            "Вам нужно организовать собаке место, где будут стоять её миски. " +
            "Советуем приобрести две отдельные миски (можно на подставке), чтобы было удобно мыть после каждого приема пищи. " +
            "Выберете то место, где тихо и спокойно. Позаботьтесь о том, чтобы вашей собаке было комфортно спать." +
            " Собаки любят спать на кровати вместе с хозяином. " +
            "Если вы не хотите, чтобы собака спала с вами, то выберете ей удобный лежак или кресло." +
            " Дайте собаке выбрать место, где ей удобно отдыхать. Вам понадобится приучать собаку к одиночеству. " +
            "Заранее подумайте о том, где собаке будет комфортно оставаться одной. " +
            "Важно, чтобы у собаки был доступ к еде и воде, а также важно пространство для исследований и передвижений ."),

    PREPARING_HOUSE_FOR_A_DISABLED_DOG("\n" +
            "Если вы решили взять собаку с ограниченными возможностями, то к списку рекомендаций по обустройству дома для " +
            "взрослой собаки добавляются еще некоторые условия. С чего начать: повесьте медальоны или колокольчики," +
            " которые звенят или издают звуки, на других животных в доме, и сами тоже наденьте такой, " +
            "чтобы ваша слепая собака знала, где находятся ее товарищи и хозяева.\n" +
            "\n" +
            "Обучите собаку команде «Внимание!», чтобы она знала, что приближается к препятствию. " +
            "Рекомендуем также научить команде «Ступенька!», чтобы она знала, когда перед ней лестница. " +
            "Дрессировка никогда не повредит.\n" +
            "\n" +
            "Опуститесь на уровень вашей собаки, чтобы поискать в доме вещи, которые могут причинить ей вред. " +
            "Например, острые углы стола могут представлять реальную опасность, если питомец будет двигаться слишком быстро.\n" +
            "\n" +
            "Проработайте с ней несколько стандартных маршрутов — например, от кровати до миски и поилки, " +
            "до задней двери и ее места для сна. Держите эти маршруты свободными от каких-либо препятствий," +
            " чтобы ей было легче передвигаться по дому. " +
            "Когда вы выводите собаку на улицу, вам придется держать ее на поводке, чтобы направить в те места, " +
            "где она должна делать свои дела. Через некоторое время остальные ее чувства усилятся и помогут ей " +
            "справляться самостоятельно.\n" +
            "\n"),

    DOG_HANDLERS_ADVICE("Для первого общения с животными приходите в часы посещений животных. \n" +
            "Посещение возможно во все дни с 6-10 и с 17-20, кроме санитарных — понедельника и пятницы.\n" +
            " В эти часы желающие под присмотром кинолога могут прийти и пообщаться с животными,\n " +
            "сходить с ними на прогулку, принести корм и лакомства. "),

    REASONS_FOR_REFUSAL("Существует пять причин, по которым чаще всего отказывают желающим «усыновить» домашнего любимца\n" +
            "1. Большое количество животных дома\n" +
            "2. Нестабильные отношения в семье\n" +
            "3. Наличие маленьких детей\n" +
            "4. Съемное жилье\n" +
            "5. Животное в подарок или для работы\n"),


    VERIFIED_DOG_HANDLERS("Если вам нужна помощь кинолога советуем обращаться:\n" +
            "-по воспитанию и дрессировке:Игорь В.т. 8(---)-------, проф.стаж более 16лет; \n" +
            "-помощь в выгуле сервис по выгулу и передержке собак: «Прогулка дога» т. 8(---)-------- \n" +
            "- по дрессировке и здоровью: Сергей Н. т. 8(---)-------, ветеринарный врач по образованию,\n" +
            " бихевиорист, зоопсихолог, индивидуальный подход");


    private final String typeOfInfo;

    private PreparingInfoDog(String typeOfInfo) {
        this.typeOfInfo = typeOfInfo;
    }

    public String getTypeOfInfo() {
        return this.getTypeOfInfo();
    }


}
